Lab_sessions/lab_08.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-12-20 Tue 22:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>R modelling. Lab session 08</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Ballesteros Chávez." />
</head>
<body>
<div id="content">
<h1 class="title">R modelling. Lab session 08</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8a18b1d">Introduction</a></li>
<li><a href="#orgf946b48">Task</a></li>
</ul>
</div>
</div>


<div id="outline-container-org8a18b1d" class="outline-2">
<h2 id="org8a18b1d">Introduction</h2>
<div class="outline-text-2" id="text-org8a18b1d">
<p>
Using the function <code>lm</code> in R it is possible to run different regression models.
</p>

<ul class="org-ul">
<li>Linear model: \(Y = a_{0} + a_{1}X\).</li>
<li>Polynomial regressions: \(Y = a_{0} + a_{1}X + a_{2} X^2 + \cdots + a_{n}X^n\).</li>
<li>Exponential models: \(Y = a_{0} e^{a_{1}x}\).</li>
</ul>
</div>
</div>

<div id="outline-container-orgf946b48" class="outline-2">
<h2 id="orgf946b48">Task</h2>
<div class="outline-text-2" id="text-orgf946b48">
<p>
From the data set <code>Ideal_models.csv</code>
</p>

<p>
a) Choose between the linear model, polynomial degree two and exponential model and 
determine what is the best model for <code>Y1, Y2</code> and <code>Y3</code> each one as a function depending on <code>X</code>.
</p>

<p>
b) Plot the observations and the fitted model in each case.
</p>

<p>
c) Plot the analysis of residues and discuss your observations.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Ballesteros Chávez.</p>
<p class="date">Created: 2022-12-20 Tue 22:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
